snlkuharlocal/src/Documents/ПолныеДанныеЗаданияНабора/ПолныеДанныеЗаданияНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПолныеДанныеЗаданияНабора</name>
  <basedOn>Document.ЗаданиеНабора</basedOn>
  <attributes>
    <name>ОтгрузкаКомплектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиентаFBS</name>
    <type>
      <types>DocumentRef.ЗаказКлиентаFBS</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказаFBS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКодFBS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказаFBS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКодFBS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНоменклатурыОтсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукцииОтсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоТовар</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ПолныеДанныеЗаданияНабора/ManagerModule.bsl
Функция ПечатьДанныхДляЗаказа (ПолныеДанныеЗаданияНабораСсылка) экспорт
	РеквизитыШапки=ПолучитьРеквизитыШапки(ПолныеДанныеЗаданияНабораСсылка,"Накладная,Контрагент,ОтгрузкаКомплектов","Документ");
	Контрагент=РеквизитыШапки.Контрагент;
	Накладная=РеквизитыШапки.Накладная;
	
	ДопПараметрыНакладной=ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Накладная);
	если ДопПараметрыНакладной.Имя="WB_FBS" тогда
		ПечатьДанныхДляОтгрузкиВБ(ПолныеДанныеЗаданияНабораСсылка);
	иначе
		Сообщить("Для данной накладной печать не предусмотрена");
	КонецЕсли;
	
	
	
КонецФункции


Функция ПечатьДанныхДляОтгрузкиВБ (ПолныеДанныеЗаданияНабораСсылка)   
	если ложь тогда ПолныеДанныеЗаданияНабораСсылка=Документы.ПолныеДанныеЗаданияНабора.ПустаяСсылка(); КонецЕсли;
	
	ТаблицаДанныхМатрицы=ПолныеДанныеЗаданияНабораСсылка.ПолучитьОбъект().ЗаполнитьТаблицуДанныхМатрицы();
	
	ПолноеИмяФайла	=СокрЛП(Константы.КаталогВнешнихОтчетов.Получить()+"PrnForms\РаботаСЗаказомКлиента.epf");
	ОбработкаПечати=ВнешниеОбработки.Создать(ПолноеИмяФайла);
	
	
	// Кухарь А.Ю.  24.03.2023 начало
	// QR
	ПолноеИмяФайлаQR	=СокрЛП(Константы.КаталогВнешнихОтчетов.Получить()+"PrnForms\РаботаСЗаказомКлиента.epf");
	ОбработкаПечатиQR=ВнешниеОбработки.Создать(ПолноеИмяФайлаQR);
	МакетQR=ОбработкаПечатиQR.ПолучитьМакет("КРВайлдберисПакетная"); 
	ОблСтрокаQR=МакетQR.ПолучитьОбласть("Строка");	
	Размер=144;				
	// Кухарь А.Ю.  24.03.2023 конец
	
	
	
	ТабДок=новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати="ЛентаFBSWB";
	
	
	НомерНакладной=ПолучитьРеквизитШапки(ПолныеДанныеЗаданияНабораСсылка,"Накладная.Номер","Документ");
	Сектор=ПолучитьРеквизитШапки(ПолныеДанныеЗаданияНабораСсылка,"ДокОснование.Сектор","Документ");
	
	ОблНачалоКонец=ПолучитьМакет("ЛентаЭтикетокДляНабора").ПолучитьОбласть("НачалоКонец");
	ОблНачалоКонец.Параметры.Накладная= НомерНакладной;
	ОблНачалоКонец.Параметры.Сектор=Сектор;
	ОблНачалоКонец.Параметры.НачалоКонец="Начало";
	ТабДок.Вывести(ОблНачалоКонец);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	запрос=новый запрос;
	// Кухарь А.Ю.  28.03.2023 начало
	//
	//запрос.Текст="ВЫБРАТЬ
	//|	ПолныеДанныеЗаданияНабораТовары.Номенклатура КАК Номенклатура,
	//|	СУММА(ПолныеДанныеЗаданияНабораТовары.Количество) КАК Количество,
	//|	ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS КАК НомерЗаказаFBS,
	//|	ВЫБОР
	//|		КОГДА ПолныеДанныеЗаданияНабораТовары.Номенклатура.Родитель.ВидКомплекта = &Комплект
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ЭтоКомплект,
	//|	ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS КАК ШтрихКодFBS,
	//|	ПолныеДанныеЗаданияНабораТовары.ПрефиксЗаказа КАК ПрефиксЗаказа,
	//|	ПолныеДанныеЗаданияНабораТовары.СуффиксЗаказа КАК СуффиксЗаказа
	//|ИЗ
	//|	Документ.ПолныеДанныеЗаданияНабора.Товары КАК ПолныеДанныеЗаданияНабораТовары
	//|ГДЕ
	//|	ПолныеДанныеЗаданияНабораТовары.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПолныеДанныеЗаданияНабораТовары.Номенклатура,
	//|	ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS,
	//|	ВЫБОР
	//|		КОГДА ПолныеДанныеЗаданияНабораТовары.Номенклатура.Родитель.ВидКомплекта = &Комплект
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ,
	//|	ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS,
	//|	ПолныеДанныеЗаданияНабораТовары.ПрефиксЗаказа,
	//|	ПолныеДанныеЗаданияНабораТовары.СуффиксЗаказа
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерЗаказаFBS,
	//|	ЭтоКомплект";
	запрос.Текст="ВЫБРАТЬ
	             |	т1.Номенклатура КАК Номенклатура,
	             |	СУММА(т1.Количество) КАК Количество,
	             |	т1.НомерЗаказаFBS КАК НомерЗаказаFBS,
	             |	т1.ЭтоКомплект КАК ЭтоКомплект,
	             |	т1.ШтрихКодFBS КАК ШтрихКодFBS,
	             |	т1.ПрефиксЗаказа КАК ПрефиксЗаказа,
	             |	т1.СуффиксЗаказа КАК СуффиксЗаказа,
	             |	т1.МодельСпайки КАК МодельСпайки
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		ПолныеДанныеЗаданияНабораТовары.Номенклатура КАК Номенклатура,
	             |		ПолныеДанныеЗаданияНабораТовары.Количество КАК Количество,
	             |		ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS КАК НомерЗаказаFBS,
	             |		ВЫБОР
	             |			КОГДА ПолныеДанныеЗаданияНабораТовары.Номенклатура.Родитель.ВидКомплекта = &Комплект
	             |				ТОГДА ИСТИНА
	             |			ИНАЧЕ ЛОЖЬ
	             |		КОНЕЦ КАК ЭтоКомплект,
	             |		ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS КАК ШтрихКодFBS,
	             |		ПолныеДанныеЗаданияНабораТовары.ПрефиксЗаказа КАК ПрефиксЗаказа,
	             |		ПолныеДанныеЗаданияНабораТовары.СуффиксЗаказа КАК СуффиксЗаказа,
	             |		МАКСИМУМ(ЕСТЬNULL(НоменклатураКоплектующие.Номенклатура.Родитель, ПолныеДанныеЗаданияНабораТовары.Номенклатура.Родитель)) КАК МодельСпайки
	             |	ИЗ
	             |		Документ.ПолныеДанныеЗаданияНабора.Товары КАК ПолныеДанныеЗаданияНабораТовары
	             |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	             |			ПО ПолныеДанныеЗаданияНабораТовары.Номенклатура = НоменклатураКоплектующие.Ссылка
	             |				И (НоменклатураКоплектующие.Номенклатура.Родитель.ВидНоменклатуры = &Товар)
	             |	ГДЕ
	             |		ПолныеДанныеЗаданияНабораТовары.Ссылка = &Ссылка
	             |	
	             |	СГРУППИРОВАТЬ ПО
	             |		ПолныеДанныеЗаданияНабораТовары.Номенклатура,
	             |		ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS,
	             |		ВЫБОР
	             |			КОГДА ПолныеДанныеЗаданияНабораТовары.Номенклатура.Родитель.ВидКомплекта = &Комплект
	             |				ТОГДА ИСТИНА
	             |			ИНАЧЕ ЛОЖЬ
	             |		КОНЕЦ,
	             |		ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS,
	             |		ПолныеДанныеЗаданияНабораТовары.ПрефиксЗаказа,
	             |		ПолныеДанныеЗаданияНабораТовары.СуффиксЗаказа,
	             |		ПолныеДанныеЗаданияНабораТовары.Количество) КАК т1
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	т1.Номенклатура,
	             |	т1.НомерЗаказаFBS,
	             |	т1.ЭтоКомплект,
	             |	т1.ШтрихКодFBS,
	             |	т1.ПрефиксЗаказа,
	             |	т1.СуффиксЗаказа,
	             |	т1.МодельСпайки
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	т1.МодельСпайки.Родитель.Родитель.Родитель,
	             |	т1.МодельСпайки.Родитель.Родитель,
	             |	т1.МодельСпайки.Родитель,
	             |	МодельСпайки";
	запрос.УстановитьПараметр("Товар",Перечисления.ВидыНоменклаутры.Товар);
	// Кухарь А.Ю.  28.03.2023 конец
	
	запрос.УстановитьПараметр("Ссылка",ПолныеДанныеЗаданияНабораСсылка);
	запрос.УстановитьПараметр("Комплект",Перечисления.ВидыКомплектов.Комплект);
	Результат=запрос.Выполнить().Выгрузить();
	
	МожноПоказывать=Истина;
	
	
	для каждого СтрТЧ из Результат цикл
		Номенклатура=СтрТЧ.Номенклатура;
		ЭтоКомплект=СтрТЧ.ЭтоКомплект;
		
		//QR
		если не ЗначениеЗаполнено(СтрТЧ.СуффиксЗаказа) тогда
			СообщитьИзМодуля("У заказа "+СтрТЧ.НомерЗаказаFBS+" не заполнен суффикс заказа.");
			МожноПоказывать=Ложь;
		КонецЕсли;	
		если не ЗначениеЗаполнено(СтрТЧ.ПрефиксЗаказа) тогда
			СообщитьИзМодуля("У заказа "+СтрТЧ.НомерЗаказаFBS+" не заполнен преффикс заказа.");
			МожноПоказывать=Ложь;
		КонецЕсли;	
			
		если не ЗначениеЗаполнено(СтрТЧ.ШтрихКодFBS) тогда
			СообщитьИзМодуля("У заказа "+СтрТЧ.НомерЗаказаFBS+" не запонен штрихкод заказа.");
			МожноПоказывать=Ложь;
		КонецЕсли;	
			
		
		
		ЗаполнитьЗначенияСвойств(ОблСтрокаQR.Параметры,СтрТЧ);
		ДвДанные = ФормированиеПечатныхФорм.ДанныеQRКода(СтрТЧ.ШтрихКодFBS,0,Размер);
		Если ДвДанные <> Неопределено Тогда
			Карт = Новый Картинка(ДвДанные);				
			ОблСтрокаQR.Область(1, 2).Картинка = Карт;
		КонецЕсли;	
		ТабДок.Вывести(ОблСтрокаQR);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		//QR		   
		
		
		СтрокаМатрицы=ТаблицаДанныхМатрицы.Найти(Номенклатура,"Номенклатура");
		Если СтрокаМатрицы=Неопределено тогда
			СообщитьИзМодуля(""+Номенклатура+" нет в матрице. Этикетка не распечатана.");
			МожноПоказывать=Ложь;
		КонецЕсли;
		
		НаборПолей=новый Структура("КодПроизводителя,Модель,ЦветБольшой,РазмерБольшой,РусскоеНаименованиеЦвета,РусскийПроизводитель,ДатаИзготовления,НаименованиеНоменклатуры,РазмерКомплекта");
		НаборПолей.ДатаИзготовления = НРег(Формат(ТекущаяДата() -90*24*60*60,"ДФ=MMMM")+ " "+Формат(НачалоМесяца(ТекущаяДата() -90*24*60*60),"ДФ=yyyy")+ " г.");
		ЗаполнитьЗначенияСвойств(НаборПолей,СтрокаМатрицы);
		НаборПолей.РазмерБольшой=ВРег(СтрокаМатрицы.Размер);
		НаборПолей.ЦветБольшой=ВРег(СтрокаМатрицы.Цвет);
		НаборПолей.РусскоеНаименованиеЦвета=ВРег(СтрокаМатрицы.РусскоеНаименованиеЦвета);
		
		если ЭтоКомплект тогда
			Макет=ОбработкаПечати.ПолучитьМакет("ЭтикеткаКомплект");
			НаборПолей.РазмерКомплекта=ПолучитьРеквизитШапки(Номенклатура,"Родитель.ШтукВКомплекте","Справочник"); 
		иначе
			Макет=ОбработкаПечати.ПолучитьМакет("Этикетка1_2х0_85_ЕАСПакетная");
		КонецЕсли;
		
		
		ОблЭтикетка=макет.получитьобласть("Строка");
		ОблЭтикетка.параметры.заполнить(НаборПолей);
		Для Каждого Рисунок Из ОблЭтикетка.Рисунки Цикл	
			Если Лев(Рисунок.Имя,6)="Объект" Тогда
				ОбъектШК			=Рисунок.Объект;
				ОбъектШК.Сообщение	=СтрокаМатрицы.ШтрихКод;
			КонецЕсли;
		КонецЦикла;
		
		ТабДок.Вывести(ОблЭтикетка);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	ОблНачалоКонец.Параметры.НачалоКонец="Конец";
	ТабДок.Вывести(ОблНачалоКонец);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	
	если МожноПоказывать тогда
		ТабДок.Показать();
	КонецЕсли;
		
	
	
КонецФункции

//Кухарь 03.06.2024 начало
Функция ПолучитьДокументПоЗНБ (ЗНБ)  экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПолныеДанныеЗаданияНабора.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПолныеДанныеЗаданияНабора КАК ПолныеДанныеЗаданияНабора
	|ГДЕ
	|	ПолныеДанныеЗаданияНабора.ДокОснование = &ЗНБ
	|	И ПолныеДанныеЗаданияНабора.Проведен";
	запрос.УстановитьПараметр("ЗНБ",ЗНБ);
	выборка=запрос.Выполнить().Выбрать();
	
	пока выборка.Следующий() цикл
		возврат выборка.ссылка;
	КонецЦикла;
	
	
	возврат Неопределено;
КонецФункции
//Кухарь 03.06.2024 конец
